#include <stdio.h>
#include <locale.h>
#include <stdlib.h>

void main() {
	setlocale(LC_CTYPE, "");

	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* Тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("* Выполнил: Яковлев В.А.                                                          *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");

	system("pause");
}