#include <stdio.h>

int main() {
	printf("\n\t1\n\t\t2\n\t\t\t3\n"); // subtask 1-3
	//------------------------------------------------------------------------
	printf("%1d, %2d, %3d, %4d \n", 1,2,3,4); // subtask 4
	//------------------------------------------------------------------------
	printf("%10.5f\n", 12.234567); //subtask 5-6
	//------------------------------------------------------------------------
	printf("Остаток от деления %d на %d равен %d \n", 5, 2, 5%2); // subtask 7
	//------------------------------------------------------------------------
	printf("Деление %d на %d равен %d \n", 7, 5, 7/5); // subtask 8
	//------------------------------------------------------------------------
	printf("Умножение %d на %d равно %d \n", 2000, 4, 2000*4); // subtask 9
	//------------------------------------------------------------------------
	printf("%g разделить %e равно %f\n", 5., 2000000., 5./2000000.); //subtask 10
	printf("%d разделить %d равно %d\n", 5., 2000000., 5./2000000.); //subtask 11
	printf("%f разделить %f равно %f\n", 5., 2000000., 5./2000000.); //subtask 12
	printf("%g разделить %g равно %e\n", 5., 2000000., 5./2000000.); //subtask 13
	printf("%e разделить %e равно %e\n", 5., 2000000., 5./2000000.); //subtask 14
}
