#include <stdio.h>
#include <locale.h>

void main() {
	setlocale(LC_CTYPE, "RUS");

	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* Тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("* Выполнил: Яковлев В.А.                                                          *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");

	return 0;
}