#include <stdio.h>
#include <locale.h>

void name() {
	setlocale(LC_CTYPE, "");

	puts("***********************************************************************************\n*                                                                                 *\n* Тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *\n*                                                                                 *\n* Выполнил: Яковлев В.А.                                                          *\n*                                                                                 *\n***********************************************************************************");
}

void HW() {
	puts("Hello, World!");
}

void date(){
	puts("             ___   ___   ___   ____              ");
	puts("   /| |  |  |   | |   |     | |                  ");
	puts("    | |  |  |   | |___|  ___| |____              ");
	puts("    | ---|  |   |     |  |        |              ");
	puts("    |    |  |___|  ___|  |___  ___|              ");
	puts("                                                 ");
}

void main() {
	HW();
	name();
	date();
}